GopalSaraf/Practicals/PSDL/include/proc/pic16f1613.inc
// Register: CRCSHIFTH
#define CRCSHIFTH CRCSHIFTH
CRCSHIFTH                                equ 0796h
// bitfield definitions
CRCSHIFTH_SHIFT_POSN                     equ 0000h
CRCSHIFTH_SHIFT_POSITION                 equ 0000h
CRCSHIFTH_SHIFT_SIZE                     equ 0008h
CRCSHIFTH_SHIFT_LENGTH                   equ 0008h
CRCSHIFTH_SHIFT_MASK                     equ 00FFh
CRCSHIFTH_SHIFT8_POSN                    equ 0000h
CRCSHIFTH_SHIFT8_POSITION                equ 0000h
CRCSHIFTH_SHIFT8_SIZE                    equ 0001h
CRCSHIFTH_SHIFT8_LENGTH                  equ 0001h
CRCSHIFTH_SHIFT8_MASK                    equ 0001h
CRCSHIFTH_SHIFT9_POSN                    equ 0001h
CRCSHIFTH_SHIFT9_POSITION                equ 0001h
CRCSHIFTH_SHIFT9_SIZE                    equ 0001h
CRCSHIFTH_SHIFT9_LENGTH                  equ 0001h
CRCSHIFTH_SHIFT9_MASK                    equ 0002h
CRCSHIFTH_SHIFT10_POSN                   equ 0002h
CRCSHIFTH_SHIFT10_POSITION               equ 0002h
CRCSHIFTH_SHIFT10_SIZE                   equ 0001h
CRCSHIFTH_SHIFT10_LENGTH                 equ 0001h
CRCSHIFTH_SHIFT10_MASK                   equ 0004h
CRCSHIFTH_SHIFT11_POSN                   equ 0003h
CRCSHIFTH_SHIFT11_POSITION               equ 0003h
CRCSHIFTH_SHIFT11_SIZE                   equ 0001h
CRCSHIFTH_SHIFT11_LENGTH                 equ 0001h
CRCSHIFTH_SHIFT11_MASK                   equ 0008h
CRCSHIFTH_SHIFT12_POSN                   equ 0004h
CRCSHIFTH_SHIFT12_POSITION               equ 0004h
CRCSHIFTH_SHIFT12_SIZE                   equ 0001h
CRCSHIFTH_SHIFT12_LENGTH                 equ 0001h
CRCSHIFTH_SHIFT12_MASK                   equ 0010h
CRCSHIFTH_SHIFT13_POSN                   equ 0005h
CRCSHIFTH_SHIFT13_POSITION               equ 0005h
CRCSHIFTH_SHIFT13_SIZE                   equ 0001h
CRCSHIFTH_SHIFT13_LENGTH                 equ 0001h
CRCSHIFTH_SHIFT13_MASK                   equ 0020h
CRCSHIFTH_SHIFT14_POSN                   equ 0006h
CRCSHIFTH_SHIFT14_POSITION               equ 0006h
CRCSHIFTH_SHIFT14_SIZE                   equ 0001h
CRCSHIFTH_SHIFT14_LENGTH                 equ 0001h
CRCSHIFTH_SHIFT14_MASK                   equ 0040h
CRCSHIFTH_SHIFT15_POSN                   equ 0007h
CRCSHIFTH_SHIFT15_POSITION               equ 0007h
CRCSHIFTH_SHIFT15_SIZE                   equ 0001h
CRCSHIFTH_SHIFT15_LENGTH                 equ 0001h
CRCSHIFTH_SHIFT15_MASK                   equ 0080h
CRCSHIFTH_CRCSHIFT_POSN                  equ 0000h
CRCSHIFTH_CRCSHIFT_POSITION              equ 0000h
CRCSHIFTH_CRCSHIFT_SIZE                  equ 0008h
CRCSHIFTH_CRCSHIFT_LENGTH                equ 0008h
CRCSHIFTH_CRCSHIFT_MASK                  equ 00FFh
CRCSHIFTH_CRCSHIFT8_POSN                 equ 0000h
CRCSHIFTH_CRCSHIFT8_POSITION             equ 0000h
CRCSHIFTH_CRCSHIFT8_SIZE                 equ 0001h
CRCSHIFTH_CRCSHIFT8_LENGTH               equ 0001h
CRCSHIFTH_CRCSHIFT8_MASK                 equ 0001h
CRCSHIFTH_CRCSHIFT9_POSN                 equ 0001h
CRCSHIFTH_CRCSHIFT9_POSITION             equ 0001h
CRCSHIFTH_CRCSHIFT9_SIZE                 equ 0001h
CRCSHIFTH_CRCSHIFT9_LENGTH               equ 0001h
CRCSHIFTH_CRCSHIFT9_MASK                 equ 0002h
CRCSHIFTH_CRCSHIFT10_POSN                equ 0002h
CRCSHIFTH_CRCSHIFT10_POSITION            equ 0002h
CRCSHIFTH_CRCSHIFT10_SIZE                equ 0001h
CRCSHIFTH_CRCSHIFT10_LENGTH              equ 0001h
CRCSHIFTH_CRCSHIFT10_MASK                equ 0004h
CRCSHIFTH_CRCSHIFT11_POSN                equ 0003h
CRCSHIFTH_CRCSHIFT11_POSITION            equ 0003h
CRCSHIFTH_CRCSHIFT11_SIZE                equ 0001h
CRCSHIFTH_CRCSHIFT11_LENGTH              equ 0001h
CRCSHIFTH_CRCSHIFT11_MASK                equ 0008h
CRCSHIFTH_CRCSHIFT12_POSN                equ 0004h
CRCSHIFTH_CRCSHIFT12_POSITION            equ 0004h
CRCSHIFTH_CRCSHIFT12_SIZE                equ 0001h
CRCSHIFTH_CRCSHIFT12_LENGTH              equ 0001h
CRCSHIFTH_CRCSHIFT12_MASK                equ 0010h
CRCSHIFTH_CRCSHIFT13_POSN                equ 0005h
CRCSHIFTH_CRCSHIFT13_POSITION            equ 0005h
CRCSHIFTH_CRCSHIFT13_SIZE                equ 0001h
CRCSHIFTH_CRCSHIFT13_LENGTH              equ 0001h
CRCSHIFTH_CRCSHIFT13_MASK                equ 0020h
CRCSHIFTH_CRCSHIFT14_POSN                equ 0006h
CRCSHIFTH_CRCSHIFT14_POSITION            equ 0006h
CRCSHIFTH_CRCSHIFT14_SIZE                equ 0001h
CRCSHIFTH_CRCSHIFT14_LENGTH              equ 0001h
CRCSHIFTH_CRCSHIFT14_MASK                equ 0040h
CRCSHIFTH_CRCSHIFT15_POSN                equ 0007h
CRCSHIFTH_CRCSHIFT15_POSITION            equ 0007h
CRCSHIFTH_CRCSHIFT15_SIZE                equ 0001h
CRCSHIFTH_CRCSHIFT15_LENGTH              equ 0001h
CRCSHIFTH_CRCSHIFT15_MASK                equ 0080h

// Register: CRCXORL
#define CRCXORL CRCXORL
CRCXORL                                  equ 0797h
// bitfield definitions
CRCXORL_XOR1_POSN                        equ 0001h
CRCXORL_XOR1_POSITION                    equ 0001h
CRCXORL_XOR1_SIZE                        equ 0001h
CRCXORL_XOR1_LENGTH                      equ 0001h
CRCXORL_XOR1_MASK                        equ 0002h
CRCXORL_XOR2_POSN                        equ 0002h
CRCXORL_XOR2_POSITION                    equ 0002h
CRCXORL_XOR2_SIZE                        equ 0001h
CRCXORL_XOR2_LENGTH                      equ 0001h
CRCXORL_XOR2_MASK                        equ 0004h
CRCXORL_XOR3_POSN                        equ 0003h
CRCXORL_XOR3_POSITION                    equ 0003h
CRCXORL_XOR3_SIZE                        equ 0001h
CRCXORL_XOR3_LENGTH                      equ 0001h
CRCXORL_XOR3_MASK                        equ 0008h
CRCXORL_XOR4_POSN                        equ 0004h
CRCXORL_XOR4_POSITION                    equ 0004h
CRCXORL_XOR4_SIZE                        equ 0001h
CRCXORL_XOR4_LENGTH                      equ 0001h
CRCXORL_XOR4_MASK                        equ 0010h
CRCXORL_XOR5_POSN                        equ 0005h
CRCXORL_XOR5_POSITION                    equ 0005h
CRCXORL_XOR5_SIZE                        equ 0001h
CRCXORL_XOR5_LENGTH                      equ 0001h
CRCXORL_XOR5_MASK                        equ 0020h
CRCXORL_XOR6_POSN                        equ 0006h
CRCXORL_XOR6_POSITION                    equ 0006h
CRCXORL_XOR6_SIZE                        equ 0001h
CRCXORL_XOR6_LENGTH                      equ 0001h
CRCXORL_XOR6_MASK                        equ 0040h
CRCXORL_XOR7_POSN                        equ 0007h
CRCXORL_XOR7_POSITION                    equ 0007h
CRCXORL_XOR7_SIZE                        equ 0001h
CRCXORL_XOR7_LENGTH                      equ 0001h
CRCXORL_XOR7_MASK                        equ 0080h
CRCXORL_CRCXOR1_POSN                     equ 0001h
CRCXORL_CRCXOR1_POSITION                 equ 0001h
CRCXORL_CRCXOR1_SIZE                     equ 0001h
CRCXORL_CRCXOR1_LENGTH                   equ 0001h
CRCXORL_CRCXOR1_MASK                     equ 0002h
CRCXORL_CRCXOR2_POSN                     equ 0002h
CRCXORL_CRCXOR2_POSITION                 equ 0002h
CRCXORL_CRCXOR2_SIZE                     equ 0001h
CRCXORL_CRCXOR2_LENGTH                   equ 0001h
CRCXORL_CRCXOR2_MASK                     equ 0004h
CRCXORL_CRCXOR3_POSN                     equ 0003h
CRCXORL_CRCXOR3_POSITION                 equ 0003h
CRCXORL_CRCXOR3_SIZE                     equ 0001h
CRCXORL_CRCXOR3_LENGTH                   equ 0001h
CRCXORL_CRCXOR3_MASK                     equ 0008h
CRCXORL_CRCXOR4_POSN                     equ 0004h
CRCXORL_CRCXOR4_POSITION                 equ 0004h
CRCXORL_CRCXOR4_SIZE                     equ 0001h
CRCXORL_CRCXOR4_LENGTH                   equ 0001h
CRCXORL_CRCXOR4_MASK                     equ 0010h
CRCXORL_CRCXOR5_POSN                     equ 0005h
CRCXORL_CRCXOR5_POSITION                 equ 0005h
CRCXORL_CRCXOR5_SIZE                     equ 0001h
CRCXORL_CRCXOR5_LENGTH                   equ 0001h
CRCXORL_CRCXOR5_MASK                     equ 0020h
CRCXORL_CRCXOR6_POSN                     equ 0006h
CRCXORL_CRCXOR6_POSITION                 equ 0006h
CRCXORL_CRCXOR6_SIZE                     equ 0001h
CRCXORL_CRCXOR6_LENGTH                   equ 0001h
CRCXORL_CRCXOR6_MASK                     equ 0040h
CRCXORL_CRCXOR7_POSN                     equ 0007h
CRCXORL_CRCXOR7_POSITION                 equ 0007h
CRCXORL_CRCXOR7_SIZE                     equ 0001h
CRCXORL_CRCXOR7_LENGTH                   equ 0001h
CRCXORL_CRCXOR7_MASK                     equ 0080h

// Register: CRCXORH
#define CRCXORH CRCXORH
CRCXORH                                  equ 0798h
// bitfield definitions
CRCXORH_XOR8_POSN                        equ 0000h
CRCXORH_XOR8_POSITION                    equ 0000h
CRCXORH_XOR8_SIZE                        equ 0001h
CRCXORH_XOR8_LENGTH                      equ 0001h
CRCXORH_XOR8_MASK                        equ 0001h
CRCXORH_XOR9_POSN                        equ 0001h
CRCXORH_XOR9_POSITION                    equ 0001h
CRCXORH_XOR9_SIZE                        equ 0001h
CRCXORH_XOR9_LENGTH                      equ 0001h
CRCXORH_XOR9_MASK                        equ 0002h
CRCXORH_XOR10_POSN                       equ 0002h
CRCXORH_XOR10_POSITION                   equ 0002h
CRCXORH_XOR10_SIZE                       equ 0001h
CRCXORH_XOR10_LENGTH                     equ 0001h
CRCXORH_XOR10_MASK                       equ 0004h
CRCXORH_XOR11_POSN                       equ 0003h
CRCXORH_XOR11_POSITION                   equ 0003h
CRCXORH_XOR11_SIZE                       equ 0001h
CRCXORH_XOR11_LENGTH                     equ 0001h
CRCXORH_XOR11_MASK                       equ 0008h
CRCXORH_XOR12_POSN                       equ 0004h
CRCXORH_XOR12_POSITION                   equ 0004h
CRCXORH_XOR12_SIZE                       equ 0001h
CRCXORH_XOR12_LENGTH                     equ 0001h
CRCXORH_XOR12_MASK                       equ 0010h
CRCXORH_XOR13_POSN                       equ 0005h
CRCXORH_XOR13_POSITION                   equ 0005h
CRCXORH_XOR13_SIZE                       equ 0001h
CRCXORH_XOR13_LENGTH                     equ 0001h
CRCXORH_XOR13_MASK                       equ 0020h
CRCXORH_XOR14_POSN                       equ 0006h
CRCXORH_XOR14_POSITION                   equ 0006h
CRCXORH_XOR14_SIZE                       equ 0001h
CRCXORH_XOR14_LENGTH                     equ 0001h
CRCXORH_XOR14_MASK                       equ 0040h
CRCXORH_XOR15_POSN                       equ 0007h
CRCXORH_XOR15_POSITION                   equ 0007h
CRCXORH_XOR15_SIZE                       equ 0001h
CRCXORH_XOR15_LENGTH                     equ 0001h
CRCXORH_XOR15_MASK                       equ 0080h
CRCXORH_CRCXOR8_POSN                     equ 0000h
CRCXORH_CRCXOR8_POSITION                 equ 0000h
CRCXORH_CRCXOR8_SIZE                     equ 0001h
CRCXORH_CRCXOR8_LENGTH                   equ 0001h
CRCXORH_CRCXOR8_MASK                     equ 0001h
CRCXORH_CRCXOR9_POSN                     equ 0001h
CRCXORH_CRCXOR9_POSITION                 equ 0001h
CRCXORH_CRCXOR9_SIZE                     equ 0001h
CRCXORH_CRCXOR9_LENGTH                   equ 0001h
CRCXORH_CRCXOR9_MASK                     equ 0002h
CRCXORH_CRCXOR10_POSN                    equ 0002h
CRCXORH_CRCXOR10_POSITION                equ 0002h
CRCXORH_CRCXOR10_SIZE                    equ 0001h
CRCXORH_CRCXOR10_LENGTH                  equ 0001h
CRCXORH_CRCXOR10_MASK                    equ 0004h
CRCXORH_CRCXOR11_POSN                    equ 0003h
CRCXORH_CRCXOR11_POSITION                equ 0003h
CRCXORH_CRCXOR11_SIZE                    equ 0001h
CRCXORH_CRCXOR11_LENGTH                  equ 0001h
CRCXORH_CRCXOR11_MASK                    equ 0008h
CRCXORH_CRCXOR12_POSN                    equ 0004h
CRCXORH_CRCXOR12_POSITION                equ 0004h
CRCXORH_CRCXOR12_SIZE                    equ 0001h
CRCXORH_CRCXOR12_LENGTH                  equ 0001h
CRCXORH_CRCXOR12_MASK                    equ 0010h
CRCXORH_CRCXOR13_POSN                    equ 0005h
CRCXORH_CRCXOR13_POSITION                equ 0005h
CRCXORH_CRCXOR13_SIZE                    equ 0001h
CRCXORH_CRCXOR13_LENGTH                  equ 0001h
CRCXORH_CRCXOR13_MASK                    equ 0020h
CRCXORH_CRCXOR14_POSN                    equ 0006h
CRCXORH_CRCXOR14_POSITION                equ 0006h
CRCXORH_CRCXOR14_SIZE                    equ 0001h
CRCXORH_CRCXOR14_LENGTH                  equ 0001h
CRCXORH_CRCXOR14_MASK                    equ 0040h
CRCXORH_CRCXOR15_POSN                    equ 0007h
CRCXORH_CRCXOR15_POSITION                equ 0007h
CRCXORH_CRCXOR15_SIZE                    equ 0001h
CRCXORH_CRCXOR15_LENGTH                  equ 0001h
CRCXORH_CRCXOR15_MASK                    equ 0080h

// Register: CRCCON0
#define CRCCON0 CRCCON0
CRCCON0                                  equ 0799h
// bitfield definitions
CRCCON0_FULL_POSN                        equ 0000h
CRCCON0_FULL_POSITION                    equ 0000h
CRCCON0_FULL_SIZE                        equ 0001h
CRCCON0_FULL_LENGTH                      equ 0001h
CRCCON0_FULL_MASK                        equ 0001h
CRCCON0_SHIFTM_POSN                      equ 0001h
CRCCON0_SHIFTM_POSITION                  equ 0001h
CRCCON0_SHIFTM_SIZE                      equ 0001h
CRCCON0_SHIFTM_LENGTH                    equ 0001h
CRCCON0_SHIFTM_MASK                      equ 0002h
CRCCON0_ACCM_POSN                        equ 0004h
CRCCON0_ACCM_POSITION                    equ 0004h
CRCCON0_ACCM_SIZE                        equ 0001h
CRCCON0_ACCM_LENGTH                      equ 0001h
CRCCON0_ACCM_MASK                        equ 0010h
CRCCON0_BUSY_POSN                        equ 0005h
CRCCON0_BUSY_POSITION                    equ 0005h
CRCCON0_BUSY_SIZE                        equ 0001h
CRCCON0_BUSY_LENGTH                      equ 0001h
CRCCON0_BUSY_MASK                        equ 0020h
CRCCON0_CRCGO_POSN                       equ 0006h
CRCCON0_CRCGO_POSITION                   equ 0006h
CRCCON0_CRCGO_SIZE                       equ 0001h
CRCCON0_CRCGO_LENGTH                     equ 0001h
CRCCON0_CRCGO_MASK                       equ 0040h
CRCCON0_EN_POSN                          equ 0007h
CRCCON0_EN_POSITION                      equ 0007h
CRCCON0_EN_SIZE                          equ 0001h
CRCCON0_EN_LENGTH                        equ 0001h
CRCCON0_EN_MASK                          equ 0080h
CRCCON0_CRCFULL_POSN                     equ 0000h
CRCCON0_CRCFULL_POSITION                 equ 0000h
CRCCON0_CRCFULL_SIZE                     equ 0001h
CRCCON0_CRCFULL_LENGTH                   equ 0001h
CRCCON0_CRCFULL_MASK                     equ 0001h
CRCCON0_CRCSHIFTM_POSN                   equ 0001h
CRCCON0_CRCSHIFTM_POSITION               equ 0001h
CRCCON0_CRCSHIFTM_SIZE                   equ 0001h
CRCCON0_CRCSHIFTM_LENGTH                 equ 0001h
CRCCON0_CRCSHIFTM_MASK                   equ 0002h
CRCCON0_CRCACCM_POSN                     equ 0004h
CRCCON0_CRCACCM_POSITION                 equ 0004h
CRCCON0_CRCACCM_SIZE                     equ 0001h
CRCCON0_CRCACCM_LENGTH                   equ 0001h
CRCCON0_CRCACCM_MASK                     equ 0010h
CRCCON0_CRCBUSY_POSN                     equ 0005h
CRCCON0_CRCBUSY_POSITION                 equ 0005h
CRCCON0_CRCBUSY_SIZE                     equ 0001h
CRCCON0_CRCBUSY_LENGTH                   equ 0001h
CRCCON0_CRCBUSY_MASK                     equ 0020h
CRCCON0_CRCEN_POSN                       equ 0007h
CRCCON0_CRCEN_POSITION                   equ 0007h
CRCCON0_CRCEN_SIZE                       equ 0001h
CRCCON0_CRCEN_LENGTH                     equ 0001h
CRCCON0_CRCEN_MASK                       equ 0080h

