GopalSaraf/Practicals/PSDL/include/proc/pic16f1613.inc
// Register: SMT2CPRH
#define SMT2CPRH SMT2CPRH
SMT2CPRH                                 equ 0DA2h
// bitfield definitions
SMT2CPRH_SMT2CPR_POSN                    equ 0000h
SMT2CPRH_SMT2CPR_POSITION                equ 0000h
SMT2CPRH_SMT2CPR_SIZE                    equ 0008h
SMT2CPRH_SMT2CPR_LENGTH                  equ 0008h
SMT2CPRH_SMT2CPR_MASK                    equ 00FFh
SMT2CPRH_SMT2CPR8_POSN                   equ 0000h
SMT2CPRH_SMT2CPR8_POSITION               equ 0000h
SMT2CPRH_SMT2CPR8_SIZE                   equ 0001h
SMT2CPRH_SMT2CPR8_LENGTH                 equ 0001h
SMT2CPRH_SMT2CPR8_MASK                   equ 0001h
SMT2CPRH_SMT2CPR9_POSN                   equ 0001h
SMT2CPRH_SMT2CPR9_POSITION               equ 0001h
SMT2CPRH_SMT2CPR9_SIZE                   equ 0001h
SMT2CPRH_SMT2CPR9_LENGTH                 equ 0001h
SMT2CPRH_SMT2CPR9_MASK                   equ 0002h
SMT2CPRH_SMT2CPR10_POSN                  equ 0002h
SMT2CPRH_SMT2CPR10_POSITION              equ 0002h
SMT2CPRH_SMT2CPR10_SIZE                  equ 0001h
SMT2CPRH_SMT2CPR10_LENGTH                equ 0001h
SMT2CPRH_SMT2CPR10_MASK                  equ 0004h
SMT2CPRH_SMT2CPR11_POSN                  equ 0003h
SMT2CPRH_SMT2CPR11_POSITION              equ 0003h
SMT2CPRH_SMT2CPR11_SIZE                  equ 0001h
SMT2CPRH_SMT2CPR11_LENGTH                equ 0001h
SMT2CPRH_SMT2CPR11_MASK                  equ 0008h
SMT2CPRH_SMT2CPR12_POSN                  equ 0004h
SMT2CPRH_SMT2CPR12_POSITION              equ 0004h
SMT2CPRH_SMT2CPR12_SIZE                  equ 0001h
SMT2CPRH_SMT2CPR12_LENGTH                equ 0001h
SMT2CPRH_SMT2CPR12_MASK                  equ 0010h
SMT2CPRH_SMT2CPR13_POSN                  equ 0005h
SMT2CPRH_SMT2CPR13_POSITION              equ 0005h
SMT2CPRH_SMT2CPR13_SIZE                  equ 0001h
SMT2CPRH_SMT2CPR13_LENGTH                equ 0001h
SMT2CPRH_SMT2CPR13_MASK                  equ 0020h
SMT2CPRH_SMT2CPR14_POSN                  equ 0006h
SMT2CPRH_SMT2CPR14_POSITION              equ 0006h
SMT2CPRH_SMT2CPR14_SIZE                  equ 0001h
SMT2CPRH_SMT2CPR14_LENGTH                equ 0001h
SMT2CPRH_SMT2CPR14_MASK                  equ 0040h
SMT2CPRH_SMT2CPR15_POSN                  equ 0007h
SMT2CPRH_SMT2CPR15_POSITION              equ 0007h
SMT2CPRH_SMT2CPR15_SIZE                  equ 0001h
SMT2CPRH_SMT2CPR15_LENGTH                equ 0001h
SMT2CPRH_SMT2CPR15_MASK                  equ 0080h

// Register: SMT2CPRU
#define SMT2CPRU SMT2CPRU
SMT2CPRU                                 equ 0DA3h
// bitfield definitions
SMT2CPRU_SMT2CPR_POSN                    equ 0000h
SMT2CPRU_SMT2CPR_POSITION                equ 0000h
SMT2CPRU_SMT2CPR_SIZE                    equ 0008h
SMT2CPRU_SMT2CPR_LENGTH                  equ 0008h
SMT2CPRU_SMT2CPR_MASK                    equ 00FFh
SMT2CPRU_SMT2CPR16_POSN                  equ 0000h
SMT2CPRU_SMT2CPR16_POSITION              equ 0000h
SMT2CPRU_SMT2CPR16_SIZE                  equ 0001h
SMT2CPRU_SMT2CPR16_LENGTH                equ 0001h
SMT2CPRU_SMT2CPR16_MASK                  equ 0001h
SMT2CPRU_SMT2CPR17_POSN                  equ 0001h
SMT2CPRU_SMT2CPR17_POSITION              equ 0001h
SMT2CPRU_SMT2CPR17_SIZE                  equ 0001h
SMT2CPRU_SMT2CPR17_LENGTH                equ 0001h
SMT2CPRU_SMT2CPR17_MASK                  equ 0002h
SMT2CPRU_SMT2CPR18_POSN                  equ 0002h
SMT2CPRU_SMT2CPR18_POSITION              equ 0002h
SMT2CPRU_SMT2CPR18_SIZE                  equ 0001h
SMT2CPRU_SMT2CPR18_LENGTH                equ 0001h
SMT2CPRU_SMT2CPR18_MASK                  equ 0004h
SMT2CPRU_SMT2CPR19_POSN                  equ 0003h
SMT2CPRU_SMT2CPR19_POSITION              equ 0003h
SMT2CPRU_SMT2CPR19_SIZE                  equ 0001h
SMT2CPRU_SMT2CPR19_LENGTH                equ 0001h
SMT2CPRU_SMT2CPR19_MASK                  equ 0008h
SMT2CPRU_SMT2CPR20_POSN                  equ 0004h
SMT2CPRU_SMT2CPR20_POSITION              equ 0004h
SMT2CPRU_SMT2CPR20_SIZE                  equ 0001h
SMT2CPRU_SMT2CPR20_LENGTH                equ 0001h
SMT2CPRU_SMT2CPR20_MASK                  equ 0010h
SMT2CPRU_SMT2CPR21_POSN                  equ 0005h
SMT2CPRU_SMT2CPR21_POSITION              equ 0005h
SMT2CPRU_SMT2CPR21_SIZE                  equ 0001h
SMT2CPRU_SMT2CPR21_LENGTH                equ 0001h
SMT2CPRU_SMT2CPR21_MASK                  equ 0020h
SMT2CPRU_SMT2CPR22_POSN                  equ 0006h
SMT2CPRU_SMT2CPR22_POSITION              equ 0006h
SMT2CPRU_SMT2CPR22_SIZE                  equ 0001h
SMT2CPRU_SMT2CPR22_LENGTH                equ 0001h
SMT2CPRU_SMT2CPR22_MASK                  equ 0040h
SMT2CPRU_SMT2CPR23_POSN                  equ 0007h
SMT2CPRU_SMT2CPR23_POSITION              equ 0007h
SMT2CPRU_SMT2CPR23_SIZE                  equ 0001h
SMT2CPRU_SMT2CPR23_LENGTH                equ 0001h
SMT2CPRU_SMT2CPR23_MASK                  equ 0080h

// Register: SMT2CPWL
#define SMT2CPWL SMT2CPWL
SMT2CPWL                                 equ 0DA4h
// bitfield definitions
SMT2CPWL_SMT2CPW_POSN                    equ 0000h
SMT2CPWL_SMT2CPW_POSITION                equ 0000h
SMT2CPWL_SMT2CPW_SIZE                    equ 0008h
SMT2CPWL_SMT2CPW_LENGTH                  equ 0008h
SMT2CPWL_SMT2CPW_MASK                    equ 00FFh
SMT2CPWL_SMT2CPW0_POSN                   equ 0000h
SMT2CPWL_SMT2CPW0_POSITION               equ 0000h
SMT2CPWL_SMT2CPW0_SIZE                   equ 0001h
SMT2CPWL_SMT2CPW0_LENGTH                 equ 0001h
SMT2CPWL_SMT2CPW0_MASK                   equ 0001h
SMT2CPWL_SMT2CPW1_POSN                   equ 0001h
SMT2CPWL_SMT2CPW1_POSITION               equ 0001h
SMT2CPWL_SMT2CPW1_SIZE                   equ 0001h
SMT2CPWL_SMT2CPW1_LENGTH                 equ 0001h
SMT2CPWL_SMT2CPW1_MASK                   equ 0002h
SMT2CPWL_SMT2CPW2_POSN                   equ 0002h
SMT2CPWL_SMT2CPW2_POSITION               equ 0002h
SMT2CPWL_SMT2CPW2_SIZE                   equ 0001h
SMT2CPWL_SMT2CPW2_LENGTH                 equ 0001h
SMT2CPWL_SMT2CPW2_MASK                   equ 0004h
SMT2CPWL_SMT2CPW3_POSN                   equ 0003h
SMT2CPWL_SMT2CPW3_POSITION               equ 0003h
SMT2CPWL_SMT2CPW3_SIZE                   equ 0001h
SMT2CPWL_SMT2CPW3_LENGTH                 equ 0001h
SMT2CPWL_SMT2CPW3_MASK                   equ 0008h
SMT2CPWL_SMT2CPW4_POSN                   equ 0004h
SMT2CPWL_SMT2CPW4_POSITION               equ 0004h
SMT2CPWL_SMT2CPW4_SIZE                   equ 0001h
SMT2CPWL_SMT2CPW4_LENGTH                 equ 0001h
SMT2CPWL_SMT2CPW4_MASK                   equ 0010h
SMT2CPWL_SMT2CPW5_POSN                   equ 0005h
SMT2CPWL_SMT2CPW5_POSITION               equ 0005h
SMT2CPWL_SMT2CPW5_SIZE                   equ 0001h
SMT2CPWL_SMT2CPW5_LENGTH                 equ 0001h
SMT2CPWL_SMT2CPW5_MASK                   equ 0020h
SMT2CPWL_SMT2CPW6_POSN                   equ 0006h
SMT2CPWL_SMT2CPW6_POSITION               equ 0006h
SMT2CPWL_SMT2CPW6_SIZE                   equ 0001h
SMT2CPWL_SMT2CPW6_LENGTH                 equ 0001h
SMT2CPWL_SMT2CPW6_MASK                   equ 0040h
SMT2CPWL_SMT2CPW7_POSN                   equ 0007h
SMT2CPWL_SMT2CPW7_POSITION               equ 0007h
SMT2CPWL_SMT2CPW7_SIZE                   equ 0001h
SMT2CPWL_SMT2CPW7_LENGTH                 equ 0001h
SMT2CPWL_SMT2CPW7_MASK                   equ 0080h

// Register: SMT2CPWH
#define SMT2CPWH SMT2CPWH
SMT2CPWH                                 equ 0DA5h
// bitfield definitions
SMT2CPWH_SMT2CPW_POSN                    equ 0000h
SMT2CPWH_SMT2CPW_POSITION                equ 0000h
SMT2CPWH_SMT2CPW_SIZE                    equ 0008h
SMT2CPWH_SMT2CPW_LENGTH                  equ 0008h
SMT2CPWH_SMT2CPW_MASK                    equ 00FFh
SMT2CPWH_SMT2CPW8_POSN                   equ 0000h
SMT2CPWH_SMT2CPW8_POSITION               equ 0000h
SMT2CPWH_SMT2CPW8_SIZE                   equ 0001h
SMT2CPWH_SMT2CPW8_LENGTH                 equ 0001h
SMT2CPWH_SMT2CPW8_MASK                   equ 0001h
SMT2CPWH_SMT2CPW9_POSN                   equ 0001h
SMT2CPWH_SMT2CPW9_POSITION               equ 0001h
SMT2CPWH_SMT2CPW9_SIZE                   equ 0001h
SMT2CPWH_SMT2CPW9_LENGTH                 equ 0001h
SMT2CPWH_SMT2CPW9_MASK                   equ 0002h
SMT2CPWH_SMT2CPW10_POSN                  equ 0002h
SMT2CPWH_SMT2CPW10_POSITION              equ 0002h
SMT2CPWH_SMT2CPW10_SIZE                  equ 0001h
SMT2CPWH_SMT2CPW10_LENGTH                equ 0001h
SMT2CPWH_SMT2CPW10_MASK                  equ 0004h
SMT2CPWH_SMT2CPW11_POSN                  equ 0003h
SMT2CPWH_SMT2CPW11_POSITION              equ 0003h
SMT2CPWH_SMT2CPW11_SIZE                  equ 0001h
SMT2CPWH_SMT2CPW11_LENGTH                equ 0001h
SMT2CPWH_SMT2CPW11_MASK                  equ 0008h
SMT2CPWH_SMT2CPW12_POSN                  equ 0004h
SMT2CPWH_SMT2CPW12_POSITION              equ 0004h
SMT2CPWH_SMT2CPW12_SIZE                  equ 0001h
SMT2CPWH_SMT2CPW12_LENGTH                equ 0001h
SMT2CPWH_SMT2CPW12_MASK                  equ 0010h
SMT2CPWH_SMT2CPW13_POSN                  equ 0005h
SMT2CPWH_SMT2CPW13_POSITION              equ 0005h
SMT2CPWH_SMT2CPW13_SIZE                  equ 0001h
SMT2CPWH_SMT2CPW13_LENGTH                equ 0001h
SMT2CPWH_SMT2CPW13_MASK                  equ 0020h
SMT2CPWH_SMT2CPW14_POSN                  equ 0006h
SMT2CPWH_SMT2CPW14_POSITION              equ 0006h
SMT2CPWH_SMT2CPW14_SIZE                  equ 0001h
SMT2CPWH_SMT2CPW14_LENGTH                equ 0001h
SMT2CPWH_SMT2CPW14_MASK                  equ 0040h
SMT2CPWH_SMT2CPW15_POSN                  equ 0007h
SMT2CPWH_SMT2CPW15_POSITION              equ 0007h
SMT2CPWH_SMT2CPW15_SIZE                  equ 0001h
SMT2CPWH_SMT2CPW15_LENGTH                equ 0001h
SMT2CPWH_SMT2CPW15_MASK                  equ 0080h

