GopalSaraf/Practicals/PSDL/include/proc/pic16f1613.inc
// Register: SMT2CON1
#define SMT2CON1 SMT2CON1
SMT2CON1                                 equ 0DABh
// bitfield definitions
SMT2CON1_MODE_POSN                       equ 0000h
SMT2CON1_MODE_POSITION                   equ 0000h
SMT2CON1_MODE_SIZE                       equ 0004h
SMT2CON1_MODE_LENGTH                     equ 0004h
SMT2CON1_MODE_MASK                       equ 000Fh
SMT2CON1_REPEAT_POSN                     equ 0006h
SMT2CON1_REPEAT_POSITION                 equ 0006h
SMT2CON1_REPEAT_SIZE                     equ 0001h
SMT2CON1_REPEAT_LENGTH                   equ 0001h
SMT2CON1_REPEAT_MASK                     equ 0040h
SMT2CON1_SMT2GO_POSN                     equ 0007h
SMT2CON1_SMT2GO_POSITION                 equ 0007h
SMT2CON1_SMT2GO_SIZE                     equ 0001h
SMT2CON1_SMT2GO_LENGTH                   equ 0001h
SMT2CON1_SMT2GO_MASK                     equ 0080h
SMT2CON1_MODE0_POSN                      equ 0000h
SMT2CON1_MODE0_POSITION                  equ 0000h
SMT2CON1_MODE0_SIZE                      equ 0001h
SMT2CON1_MODE0_LENGTH                    equ 0001h
SMT2CON1_MODE0_MASK                      equ 0001h
SMT2CON1_MODE1_POSN                      equ 0001h
SMT2CON1_MODE1_POSITION                  equ 0001h
SMT2CON1_MODE1_SIZE                      equ 0001h
SMT2CON1_MODE1_LENGTH                    equ 0001h
SMT2CON1_MODE1_MASK                      equ 0002h
SMT2CON1_MODE2_POSN                      equ 0002h
SMT2CON1_MODE2_POSITION                  equ 0002h
SMT2CON1_MODE2_SIZE                      equ 0001h
SMT2CON1_MODE2_LENGTH                    equ 0001h
SMT2CON1_MODE2_MASK                      equ 0004h
SMT2CON1_MODE3_POSN                      equ 0003h
SMT2CON1_MODE3_POSITION                  equ 0003h
SMT2CON1_MODE3_SIZE                      equ 0001h
SMT2CON1_MODE3_LENGTH                    equ 0001h
SMT2CON1_MODE3_MASK                      equ 0008h
SMT2CON1_SMT2MODE_POSN                   equ 0000h
SMT2CON1_SMT2MODE_POSITION               equ 0000h
SMT2CON1_SMT2MODE_SIZE                   equ 0004h
SMT2CON1_SMT2MODE_LENGTH                 equ 0004h
SMT2CON1_SMT2MODE_MASK                   equ 000Fh
SMT2CON1_SMT2REPEAT_POSN                 equ 0006h
SMT2CON1_SMT2REPEAT_POSITION             equ 0006h
SMT2CON1_SMT2REPEAT_SIZE                 equ 0001h
SMT2CON1_SMT2REPEAT_LENGTH               equ 0001h
SMT2CON1_SMT2REPEAT_MASK                 equ 0040h
SMT2CON1_SMT2MODE0_POSN                  equ 0000h
SMT2CON1_SMT2MODE0_POSITION              equ 0000h
SMT2CON1_SMT2MODE0_SIZE                  equ 0001h
SMT2CON1_SMT2MODE0_LENGTH                equ 0001h
SMT2CON1_SMT2MODE0_MASK                  equ 0001h
SMT2CON1_SMT2MODE1_POSN                  equ 0001h
SMT2CON1_SMT2MODE1_POSITION              equ 0001h
SMT2CON1_SMT2MODE1_SIZE                  equ 0001h
SMT2CON1_SMT2MODE1_LENGTH                equ 0001h
SMT2CON1_SMT2MODE1_MASK                  equ 0002h
SMT2CON1_SMT2MODE2_POSN                  equ 0002h
SMT2CON1_SMT2MODE2_POSITION              equ 0002h
SMT2CON1_SMT2MODE2_SIZE                  equ 0001h
SMT2CON1_SMT2MODE2_LENGTH                equ 0001h
SMT2CON1_SMT2MODE2_MASK                  equ 0004h
SMT2CON1_SMT2MODE3_POSN                  equ 0003h
SMT2CON1_SMT2MODE3_POSITION              equ 0003h
SMT2CON1_SMT2MODE3_SIZE                  equ 0001h
SMT2CON1_SMT2MODE3_LENGTH                equ 0001h
SMT2CON1_SMT2MODE3_MASK                  equ 0008h

// Register: SMT2STAT
#define SMT2STAT SMT2STAT
SMT2STAT                                 equ 0DACh
// bitfield definitions
SMT2STAT_AS_POSN                         equ 0000h
SMT2STAT_AS_POSITION                     equ 0000h
SMT2STAT_AS_SIZE                         equ 0001h
SMT2STAT_AS_LENGTH                       equ 0001h
SMT2STAT_AS_MASK                         equ 0001h
SMT2STAT_WS_POSN                         equ 0001h
SMT2STAT_WS_POSITION                     equ 0001h
SMT2STAT_WS_SIZE                         equ 0001h
SMT2STAT_WS_LENGTH                       equ 0001h
SMT2STAT_WS_MASK                         equ 0002h
SMT2STAT_TS_POSN                         equ 0002h
SMT2STAT_TS_POSITION                     equ 0002h
SMT2STAT_TS_SIZE                         equ 0001h
SMT2STAT_TS_LENGTH                       equ 0001h
SMT2STAT_TS_MASK                         equ 0004h
SMT2STAT_RST_POSN                        equ 0005h
SMT2STAT_RST_POSITION                    equ 0005h
SMT2STAT_RST_SIZE                        equ 0001h
SMT2STAT_RST_LENGTH                      equ 0001h
SMT2STAT_RST_MASK                        equ 0020h
SMT2STAT_CPWUP_POSN                      equ 0006h
SMT2STAT_CPWUP_POSITION                  equ 0006h
SMT2STAT_CPWUP_SIZE                      equ 0001h
SMT2STAT_CPWUP_LENGTH                    equ 0001h
SMT2STAT_CPWUP_MASK                      equ 0040h
SMT2STAT_CPRUP_POSN                      equ 0007h
SMT2STAT_CPRUP_POSITION                  equ 0007h
SMT2STAT_CPRUP_SIZE                      equ 0001h
SMT2STAT_CPRUP_LENGTH                    equ 0001h
SMT2STAT_CPRUP_MASK                      equ 0080h
SMT2STAT_SMT2AS_POSN                     equ 0000h
SMT2STAT_SMT2AS_POSITION                 equ 0000h
SMT2STAT_SMT2AS_SIZE                     equ 0001h
SMT2STAT_SMT2AS_LENGTH                   equ 0001h
SMT2STAT_SMT2AS_MASK                     equ 0001h
SMT2STAT_SMT2WS_POSN                     equ 0001h
SMT2STAT_SMT2WS_POSITION                 equ 0001h
SMT2STAT_SMT2WS_SIZE                     equ 0001h
SMT2STAT_SMT2WS_LENGTH                   equ 0001h
SMT2STAT_SMT2WS_MASK                     equ 0002h
SMT2STAT_SMT2TS_POSN                     equ 0002h
SMT2STAT_SMT2TS_POSITION                 equ 0002h
SMT2STAT_SMT2TS_SIZE                     equ 0001h
SMT2STAT_SMT2TS_LENGTH                   equ 0001h
SMT2STAT_SMT2TS_MASK                     equ 0004h
SMT2STAT_SMT2RESET_POSN                  equ 0005h
SMT2STAT_SMT2RESET_POSITION              equ 0005h
SMT2STAT_SMT2RESET_SIZE                  equ 0001h
SMT2STAT_SMT2RESET_LENGTH                equ 0001h
SMT2STAT_SMT2RESET_MASK                  equ 0020h
SMT2STAT_SMT2CPWUP_POSN                  equ 0006h
SMT2STAT_SMT2CPWUP_POSITION              equ 0006h
SMT2STAT_SMT2CPWUP_SIZE                  equ 0001h
SMT2STAT_SMT2CPWUP_LENGTH                equ 0001h
SMT2STAT_SMT2CPWUP_MASK                  equ 0040h
SMT2STAT_SMT2CPRUP_POSN                  equ 0007h
SMT2STAT_SMT2CPRUP_POSITION              equ 0007h
SMT2STAT_SMT2CPRUP_SIZE                  equ 0001h
SMT2STAT_SMT2CPRUP_LENGTH                equ 0001h
SMT2STAT_SMT2CPRUP_MASK                  equ 0080h

// Register: SMT2CLK
#define SMT2CLK SMT2CLK
SMT2CLK                                  equ 0DADh
// bitfield definitions
SMT2CLK_CSEL_POSN                        equ 0000h
SMT2CLK_CSEL_POSITION                    equ 0000h
SMT2CLK_CSEL_SIZE                        equ 0008h
SMT2CLK_CSEL_LENGTH                      equ 0008h
SMT2CLK_CSEL_MASK                        equ 00FFh
SMT2CLK_CSEL0_POSN                       equ 0000h
SMT2CLK_CSEL0_POSITION                   equ 0000h
SMT2CLK_CSEL0_SIZE                       equ 0001h
SMT2CLK_CSEL0_LENGTH                     equ 0001h
SMT2CLK_CSEL0_MASK                       equ 0001h
SMT2CLK_CSEL1_POSN                       equ 0001h
SMT2CLK_CSEL1_POSITION                   equ 0001h
SMT2CLK_CSEL1_SIZE                       equ 0001h
SMT2CLK_CSEL1_LENGTH                     equ 0001h
SMT2CLK_CSEL1_MASK                       equ 0002h
SMT2CLK_CSEL2_POSN                       equ 0002h
SMT2CLK_CSEL2_POSITION                   equ 0002h
SMT2CLK_CSEL2_SIZE                       equ 0001h
SMT2CLK_CSEL2_LENGTH                     equ 0001h
SMT2CLK_CSEL2_MASK                       equ 0004h
SMT2CLK_SMT2CSEL_POSN                    equ 0000h
SMT2CLK_SMT2CSEL_POSITION                equ 0000h
SMT2CLK_SMT2CSEL_SIZE                    equ 0008h
SMT2CLK_SMT2CSEL_LENGTH                  equ 0008h
SMT2CLK_SMT2CSEL_MASK                    equ 00FFh
SMT2CLK_SMT2CSEL0_POSN                   equ 0000h
SMT2CLK_SMT2CSEL0_POSITION               equ 0000h
SMT2CLK_SMT2CSEL0_SIZE                   equ 0001h
SMT2CLK_SMT2CSEL0_LENGTH                 equ 0001h
SMT2CLK_SMT2CSEL0_MASK                   equ 0001h
SMT2CLK_SMT2CSEL1_POSN                   equ 0001h
SMT2CLK_SMT2CSEL1_POSITION               equ 0001h
SMT2CLK_SMT2CSEL1_SIZE                   equ 0001h
SMT2CLK_SMT2CSEL1_LENGTH                 equ 0001h
SMT2CLK_SMT2CSEL1_MASK                   equ 0002h
SMT2CLK_SMT2CSEL2_POSN                   equ 0002h
SMT2CLK_SMT2CSEL2_POSITION               equ 0002h
SMT2CLK_SMT2CSEL2_SIZE                   equ 0001h
SMT2CLK_SMT2CSEL2_LENGTH                 equ 0001h
SMT2CLK_SMT2CSEL2_MASK                   equ 0004h

// Register: SMT2SIG
#define SMT2SIG SMT2SIG
SMT2SIG                                  equ 0DAEh
// bitfield definitions
SMT2SIG_SSEL_POSN                        equ 0000h
SMT2SIG_SSEL_POSITION                    equ 0000h
SMT2SIG_SSEL_SIZE                        equ 0008h
SMT2SIG_SSEL_LENGTH                      equ 0008h
SMT2SIG_SSEL_MASK                        equ 00FFh
SMT2SIG_SSEL0_POSN                       equ 0000h
SMT2SIG_SSEL0_POSITION                   equ 0000h
SMT2SIG_SSEL0_SIZE                       equ 0001h
SMT2SIG_SSEL0_LENGTH                     equ 0001h
SMT2SIG_SSEL0_MASK                       equ 0001h
SMT2SIG_SSEL1_POSN                       equ 0001h
SMT2SIG_SSEL1_POSITION                   equ 0001h
SMT2SIG_SSEL1_SIZE                       equ 0001h
SMT2SIG_SSEL1_LENGTH                     equ 0001h
SMT2SIG_SSEL1_MASK                       equ 0002h
SMT2SIG_SSEL2_POSN                       equ 0002h
SMT2SIG_SSEL2_POSITION                   equ 0002h
SMT2SIG_SSEL2_SIZE                       equ 0001h
SMT2SIG_SSEL2_LENGTH                     equ 0001h
SMT2SIG_SSEL2_MASK                       equ 0004h
SMT2SIG_SMT2SSEL_POSN                    equ 0000h
SMT2SIG_SMT2SSEL_POSITION                equ 0000h
SMT2SIG_SMT2SSEL_SIZE                    equ 0008h
SMT2SIG_SMT2SSEL_LENGTH                  equ 0008h
SMT2SIG_SMT2SSEL_MASK                    equ 00FFh
SMT2SIG_SMT2SSEL0_POSN                   equ 0000h
SMT2SIG_SMT2SSEL0_POSITION               equ 0000h
SMT2SIG_SMT2SSEL0_SIZE                   equ 0001h
SMT2SIG_SMT2SSEL0_LENGTH                 equ 0001h
SMT2SIG_SMT2SSEL0_MASK                   equ 0001h
SMT2SIG_SMT2SSEL1_POSN                   equ 0001h
SMT2SIG_SMT2SSEL1_POSITION               equ 0001h
SMT2SIG_SMT2SSEL1_SIZE                   equ 0001h
SMT2SIG_SMT2SSEL1_LENGTH                 equ 0001h
SMT2SIG_SMT2SSEL1_MASK                   equ 0002h
SMT2SIG_SMT2SSEL2_POSN                   equ 0002h
SMT2SIG_SMT2SSEL2_POSITION               equ 0002h
SMT2SIG_SMT2SSEL2_SIZE                   equ 0001h
SMT2SIG_SMT2SSEL2_LENGTH                 equ 0001h
SMT2SIG_SMT2SSEL2_MASK                   equ 0004h

// Register: SMT2WIN
#define SMT2WIN SMT2WIN
SMT2WIN                                  equ 0DAFh
// bitfield definitions
SMT2WIN_WSEL_POSN                        equ 0000h
SMT2WIN_WSEL_POSITION                    equ 0000h
SMT2WIN_WSEL_SIZE                        equ 0008h
SMT2WIN_WSEL_LENGTH                      equ 0008h
SMT2WIN_WSEL_MASK                        equ 00FFh
SMT2WIN_WSEL0_POSN                       equ 0000h
SMT2WIN_WSEL0_POSITION                   equ 0000h
SMT2WIN_WSEL0_SIZE                       equ 0001h
SMT2WIN_WSEL0_LENGTH                     equ 0001h
SMT2WIN_WSEL0_MASK                       equ 0001h
SMT2WIN_WSEL1_POSN                       equ 0001h
SMT2WIN_WSEL1_POSITION                   equ 0001h
SMT2WIN_WSEL1_SIZE                       equ 0001h
SMT2WIN_WSEL1_LENGTH                     equ 0001h
SMT2WIN_WSEL1_MASK                       equ 0002h
SMT2WIN_WSEL2_POSN                       equ 0002h
SMT2WIN_WSEL2_POSITION                   equ 0002h
SMT2WIN_WSEL2_SIZE                       equ 0001h
SMT2WIN_WSEL2_LENGTH                     equ 0001h
SMT2WIN_WSEL2_MASK                       equ 0004h
SMT2WIN_WSEL3_POSN                       equ 0003h
SMT2WIN_WSEL3_POSITION                   equ 0003h
SMT2WIN_WSEL3_SIZE                       equ 0001h
SMT2WIN_WSEL3_LENGTH                     equ 0001h
SMT2WIN_WSEL3_MASK                       equ 0008h
SMT2WIN_SMT2WSEL_POSN                    equ 0000h
SMT2WIN_SMT2WSEL_POSITION                equ 0000h
SMT2WIN_SMT2WSEL_SIZE                    equ 0008h
SMT2WIN_SMT2WSEL_LENGTH                  equ 0008h
SMT2WIN_SMT2WSEL_MASK                    equ 00FFh
SMT2WIN_SMT2WSEL0_POSN                   equ 0000h
SMT2WIN_SMT2WSEL0_POSITION               equ 0000h
SMT2WIN_SMT2WSEL0_SIZE                   equ 0001h
SMT2WIN_SMT2WSEL0_LENGTH                 equ 0001h
SMT2WIN_SMT2WSEL0_MASK                   equ 0001h
SMT2WIN_SMT2WSEL1_POSN                   equ 0001h
SMT2WIN_SMT2WSEL1_POSITION               equ 0001h
SMT2WIN_SMT2WSEL1_SIZE                   equ 0001h
SMT2WIN_SMT2WSEL1_LENGTH                 equ 0001h
SMT2WIN_SMT2WSEL1_MASK                   equ 0002h
SMT2WIN_SMT2WSEL2_POSN                   equ 0002h
SMT2WIN_SMT2WSEL2_POSITION               equ 0002h
SMT2WIN_SMT2WSEL2_SIZE                   equ 0001h
SMT2WIN_SMT2WSEL2_LENGTH                 equ 0001h
SMT2WIN_SMT2WSEL2_MASK                   equ 0004h
SMT2WIN_SMT2WSEL3_POSN                   equ 0003h
SMT2WIN_SMT2WSEL3_POSITION               equ 0003h
SMT2WIN_SMT2WSEL3_SIZE                   equ 0001h
SMT2WIN_SMT2WSEL3_LENGTH                 equ 0001h
SMT2WIN_SMT2WSEL3_MASK                   equ 0008h

// Register: STATUS_SHAD
#define STATUS_SHAD STATUS_SHAD
STATUS_SHAD                              equ 0FE4h
// bitfield definitions
STATUS_SHAD_C_SHAD_POSN                  equ 0000h
STATUS_SHAD_C_SHAD_POSITION              equ 0000h
STATUS_SHAD_C_SHAD_SIZE                  equ 0001h
STATUS_SHAD_C_SHAD_LENGTH                equ 0001h
STATUS_SHAD_C_SHAD_MASK                  equ 0001h
STATUS_SHAD_DC_SHAD_POSN                 equ 0001h
STATUS_SHAD_DC_SHAD_POSITION             equ 0001h
STATUS_SHAD_DC_SHAD_SIZE                 equ 0001h
STATUS_SHAD_DC_SHAD_LENGTH               equ 0001h
STATUS_SHAD_DC_SHAD_MASK                 equ 0002h
STATUS_SHAD_Z_SHAD_POSN                  equ 0002h
STATUS_SHAD_Z_SHAD_POSITION              equ 0002h
STATUS_SHAD_Z_SHAD_SIZE                  equ 0001h
STATUS_SHAD_Z_SHAD_LENGTH                equ 0001h
STATUS_SHAD_Z_SHAD_MASK                  equ 0004h

// Register: WREG_SHAD
#define WREG_SHAD WREG_SHAD
WREG_SHAD                                equ 0FE5h
// bitfield definitions
WREG_SHAD_WREG_SHAD_POSN                 equ 0000h
WREG_SHAD_WREG_SHAD_POSITION             equ 0000h
WREG_SHAD_WREG_SHAD_SIZE                 equ 0008h
WREG_SHAD_WREG_SHAD_LENGTH               equ 0008h
WREG_SHAD_WREG_SHAD_MASK                 equ 00FFh

// Register: BSR_SHAD
#define BSR_SHAD BSR_SHAD
BSR_SHAD                                 equ 0FE6h
// bitfield definitions
BSR_SHAD_BSR_SHAD_POSN                   equ 0000h
BSR_SHAD_BSR_SHAD_POSITION               equ 0000h
BSR_SHAD_BSR_SHAD_SIZE                   equ 0005h
BSR_SHAD_BSR_SHAD_LENGTH                 equ 0005h
BSR_SHAD_BSR_SHAD_MASK                   equ 001Fh

// Register: PCLATH_SHAD
#define PCLATH_SHAD PCLATH_SHAD
PCLATH_SHAD                              equ 0FE7h
// bitfield definitions
PCLATH_SHAD_PCLATH_SHAD_POSN             equ 0000h
PCLATH_SHAD_PCLATH_SHAD_POSITION         equ 0000h
PCLATH_SHAD_PCLATH_SHAD_SIZE             equ 0007h
PCLATH_SHAD_PCLATH_SHAD_LENGTH           equ 0007h
PCLATH_SHAD_PCLATH_SHAD_MASK             equ 007Fh

// Register: FSR0L_SHAD
#define FSR0L_SHAD FSR0L_SHAD
FSR0L_SHAD                               equ 0FE8h
// bitfield definitions
FSR0L_SHAD_FSR0L_SHAD_POSN               equ 0000h
FSR0L_SHAD_FSR0L_SHAD_POSITION           equ 0000h
FSR0L_SHAD_FSR0L_SHAD_SIZE               equ 0008h
FSR0L_SHAD_FSR0L_SHAD_LENGTH             equ 0008h
FSR0L_SHAD_FSR0L_SHAD_MASK               equ 00FFh

// Register: FSR0H_SHAD
#define FSR0H_SHAD FSR0H_SHAD
FSR0H_SHAD                               equ 0FE9h
// bitfield definitions
FSR0H_SHAD_FSR0H_SHAD_POSN               equ 0000h
FSR0H_SHAD_FSR0H_SHAD_POSITION           equ 0000h
FSR0H_SHAD_FSR0H_SHAD_SIZE               equ 0008h
FSR0H_SHAD_FSR0H_SHAD_LENGTH             equ 0008h
FSR0H_SHAD_FSR0H_SHAD_MASK               equ 00FFh

// Register: FSR1L_SHAD
#define FSR1L_SHAD FSR1L_SHAD
FSR1L_SHAD                               equ 0FEAh
// bitfield definitions
FSR1L_SHAD_FSR1L_SHAD_POSN               equ 0000h
FSR1L_SHAD_FSR1L_SHAD_POSITION           equ 0000h
FSR1L_SHAD_FSR1L_SHAD_SIZE               equ 0008h
FSR1L_SHAD_FSR1L_SHAD_LENGTH             equ 0008h
FSR1L_SHAD_FSR1L_SHAD_MASK               equ 00FFh

// Register: FSR1H_SHAD
#define FSR1H_SHAD FSR1H_SHAD
FSR1H_SHAD                               equ 0FEBh
// bitfield definitions
FSR1H_SHAD_FSR1H_SHAD_POSN               equ 0000h
FSR1H_SHAD_FSR1H_SHAD_POSITION           equ 0000h
FSR1H_SHAD_FSR1H_SHAD_SIZE               equ 0008h
FSR1H_SHAD_FSR1H_SHAD_LENGTH             equ 0008h
FSR1H_SHAD_FSR1H_SHAD_MASK               equ 00FFh

// Register: STKPTR
#define STKPTR STKPTR
STKPTR                                   equ 0FEDh
// bitfield definitions
STKPTR_STKPTR_POSN                       equ 0000h
STKPTR_STKPTR_POSITION                   equ 0000h
STKPTR_STKPTR_SIZE                       equ 0005h
STKPTR_STKPTR_LENGTH                     equ 0005h
STKPTR_STKPTR_MASK                       equ 001Fh

